avem-labs/Avem/libs/STM32_USB-FS-Device_Lib_V4.0.0/Utilities/STM32_EVAL/STM32303C_EVAL/stm32303c_eval_audio_codec.c
#ifdef AUDIO_MAL_DMA_IT_TC_EN
  /* Transfer complete interrupt */
  if (DMA_GetFlagStatus(AUDIO_MAL_DMA_FLAG_TC) != RESET)
  {     
 #ifdef AUDIO_MAL_MODE_NORMAL
    /* Check if the end of file has been reached */
    if (AudioRemSize > 0)
    {      
      /* Wait the DMA Channel to be effectively disabled */
      while (DMA_GetFlagStatus(AUDIO_MAL_DMA_FLAG_TC) != SET)
      {}
      
      /* Clear the Interrupt flag */
      DMA_ClearFlag(AUDIO_MAL_DMA_FLAG_TC);  
      
      /* Re-Configure the buffer address and size */
      DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t) CurrentPos;
      DMA_InitStructure.DMA_BufferSize = (uint32_t) (DMA_MAX(AudioRemSize));
      
      /* Configure the DMA Channel with the new parameters */
      DMA_Init(AUDIO_MAL_DMA_CHANNEL , &DMA_InitStructure);
      
      /* Enable the I2S DMA Channel */
      DMA_Cmd(AUDIO_MAL_DMA_CHANNEL , ENABLE);    
      
      /* Update the current pointer position */
      CurrentPos += DMA_MAX(AudioRemSize);        
      
      /* Update the remaining number of data to be played */
      AudioRemSize -= DMA_MAX(AudioRemSize);    
    }
    else
    {
      /* Disable the I2S DMA Channel */
      DMA_Cmd(AUDIO_MAL_DMA_CHANNEL , DISABLE);   
      
      /* Clear the Interrupt flag */
      DMA_ClearFlag(AUDIO_MAL_DMA_FLAG_TC);       
      
      /* Manage the remaining file size and new address offset: This function 
      should be coded by user (its prototype is already declared in stm32_eval_audio_codec.h) */  
      EVAL_AUDIO_TransferComplete_CallBack((uint32_t)CurrentPos, 0);       
    }
    
 #elif defined(AUDIO_MAL_MODE_CIRCULAR)
    /* Manage the remaining file size and new address offset: This function 
       should be coded by user (its prototype is already declared in stm32_eval_audio_codec.h) */  
    EVAL_AUDIO_TransferComplete_CallBack(pAddr, Size);    
    
    /* Clear the Interrupt flag */
    DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC);
 #endif /* AUDIO_MAL_MODE_NORMAL */  
  }
#endif /* AUDIO_MAL_DMA_IT_TC_EN */

#ifdef AUDIO_MAL_DMA_IT_HT_EN  
  /* Half Transfer complete interrupt */
  if (DMA_GetFlagStatus(AUDIO_MAL_DMA_CHANNEL, AUDIO_MAL_DMA_FLAG_HT) != RESET)
  {
    /* Manage the remaining file size and new address offset: This function 
       should be coded by user (its prototype is already declared in stm32_eval_audio_codec.h) */  
    EVAL_AUDIO_HalfTransfer_CallBack((uint32_t)pAddr, Size);    
   
    /* Clear the Interrupt flag */
    DMA_ClearFlag(AUDIO_MAL_DMA_CHANNEL, AUDIO_MAL_DMA_FLAG_HT);    
  }
#endif /* AUDIO_MAL_DMA_IT_HT_EN */
  
#ifdef AUDIO_MAL_DMA_IT_TE_EN  
  /* FIFO Error interrupt */
  if ((DMA_GetFlagStatus(AUDIO_MAL_DMA_CHANNEL, AUDIO_MAL_DMA_FLAG_TE) != RESET) || \
     (DMA_GetFlagStatus(AUDIO_MAL_DMA_CHANNEL, AUDIO_MAL_DMA_FLAG_FE) != RESET) || \
     (DMA_GetFlagStatus(AUDIO_MAL_DMA_CHANNEL, AUDIO_MAL_DMA_FLAG_DME) != RESET))
    
  {
    /* Manage the error generated on DMA FIFO: This function 
       should be coded by user (its prototype is already declared in stm32_eval_audio_codec.h) */  
    EVAL_AUDIO_Error_CallBack((uint32_t*)&pAddr);    
    
    /* Clear the Interrupt flag */
    DMA_ClearFlag(AUDIO_MAL_DMA_CHANNEL, AUDIO_MAL_DMA_FLAG_TE | AUDIO_MAL_DMA_FLAG_FE | \
                                        AUDIO_MAL_DMA_FLAG_DME);
  }  
#endif /* AUDIO_MAL_DMA_IT_TE_EN */
}

/*============================================================================
                CS42L52 Audio Codec Control Functions
  ============================================================================*/
/**
  * @brief  Initializes the audio codec and all related interfaces (control 
  *         interface: I2C and audio interface: I2S)
  * @param  OutputDevice: can be OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE,
  *                       OUTPUT_DEVICE_BOTH or OUTPUT_DEVICE_AUTO .
  * @param  Volume: Initial volume level (from 0 (Mute) to 100 (Max))
  * @param  AudioFreq: Audio frequency used to play the audio stream.
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_Init(uint16_t OutputDevice, uint8_t Volume, uint32_t AudioFreq)
{
  uint32_t counter = 0; 

  /* Configure the Codec related IOs */
  Codec_GPIO_Init();   

  /* Initialize the Control interface of the Audio Codec */
  Codec_CtrlInterface_Init();     
  
  /* Keep Codec powered OFF */
  counter += Codec_WriteRegister(0x02, 0x9E/*0x01*/);  

  switch (OutputDevice)
  {
    case OUTPUT_DEVICE_SPEAKER:
      counter += Codec_WriteRegister(0x04, 0xFA); /* SPK always ON & HP always OFF */
      OutputDev = 0xFA;
      break;
      
    case OUTPUT_DEVICE_HEADPHONE:
      counter += Codec_WriteRegister(0x04, 0xAF); /* SPK always OFF & HP always ON */
      OutputDev = 0xAF;
      break;
      
    case OUTPUT_DEVICE_BOTH:
      counter += Codec_WriteRegister(0x04, 0xAA); /* SPK always ON & HP always ON */
      OutputDev = 0xAA;
      break;
      
    case OUTPUT_DEVICE_AUTO:
      counter += Codec_WriteRegister(0x04, 0x05); /* Detect the HP or the SPK automatically */
      OutputDev = 0x05;
      break;    
      
    default:
      counter += Codec_WriteRegister(0x04, 0x05); /* Detect the HP or the SPK automatically */
      OutputDev = 0x05;
      break;    
  }
  
  /* Clock configuration: Auto detection */  
  counter += Codec_WriteRegister(0x05, 0x80);
  /* Set the Slave Mode and the audio Standard */  
  counter += Codec_WriteRegister(0x06, 0x03/*CODEC_STANDARD*/);  
  /* Interface Control 2: SCLK is Re-timed signal from MCLK*/
  counter +=Codec_WriteRegister(0x07, 0x00); 
  /* ADCA and PGAA Select: no input selected*/
  counter +=Codec_WriteRegister(0x08, 0x00);
  /* ADCB and PGAB Select: no input selected*/
  counter +=Codec_WriteRegister(0x09, 0x00); 
  /*Play Back Control 1: headphone gain is 0.4, PCM not inverted, Master not mute*/
  counter +=Codec_WriteRegister(0x0D, 0x10);/* CS42L52 has different config than CS42L52*/ 
  /* Miscellaneous Controls: Passthrough Analog & Passthrough Mute off, Soft Ramp on @0x0E*/
  counter +=Codec_WriteRegister(0x0E, 0x02);  
  /* Play Back Control 2: Headphone Mute off, speaker mute off, mono enabled */
  counter +=Codec_WriteRegister(0x0F, 0x32); 
  /* PCM A Volume: PCM Mute disabled, Volume is 0db(default) */
  counter +=Codec_WriteRegister(0x1A, 0x00);
  /* PCM B Volume: PCM Mute disabled, Volume is 0db(default) */
  counter +=Codec_WriteRegister(0x1B, 0x00); 
  /* Headphone A Volume: Headphone Volume is -6db */
  counter +=Codec_WriteRegister(0x22, (u8)(0-12));
  /* Headphone B Volume: Headphone Volume is -6db */
  counter +=Codec_WriteRegister(0x23, (u8)(0-12));    
  /* Speaker A Volume: Speaker Volume is 0db (default) */
  counter +=Codec_WriteRegister(0x24, 0x00);
  /* Speaker B Volume: Speaker Volume is 0db (default) */
  counter +=Codec_WriteRegister(0x25, 0x00);
  /* Charge Pump Frequency: 5 (default) */
  counter +=Codec_WriteRegister(0x34, 5<<4);
  /* Power Control 1: power up */
  counter += Codec_WriteRegister(0x02, 0x00); 
  counter += Codec_WriteRegister(0x20, 0xff); 
  counter += Codec_WriteRegister(0x21, 0xff); 

  /* Configure the I2S peripheral */
  Codec_AudioInterface_Init(AudioFreq);  
  
  /* Return communication control value */
  return counter;  
}

/**
  * @brief  Initializes the audio codec and all related interfaces (control 
  *         interface: I2C and audio interface: I2S)
  * @param  OutputDevice: can be OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE,
  *                       OUTPUT_DEVICE_BOTH or OUTPUT_DEVICE_AUTO .
  * @param  Volume: Initial volume level (from 0 (Mute) to 100 (Max))
  * @param  AudioFreq: Audio frequency used to play the audio stream.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_Record_Init(void)
{
  uint32_t counter = 0; 

  /* Configure the Codec related IOs */
  Codec_GPIO_Recorder_Init();   
  
  /* Initialize the Control interface of the Audio Codec */
  Codec_CtrlInterface_Init();     
  
  /* Mono Record @ MIC1+ with Bias */
  /* Power Control 2[@03h]: MICB Off, MIC A & Bias On */
  counter += Codec_WriteRegister(0x03, 0x04);
  /* Power Control 3[@04h]: headphone A/B Off, speaker A & B Off */
  counter += Codec_WriteRegister(0x04, 0xFF);
  /* Clocking Control: auto sample rate(Fs) */
  counter += Codec_WriteRegister(0x05, 0x80);
  /* Interface Control 1: slave, LeftJustified, 16-bit data */
  counter += Codec_WriteRegister(0x06, 0x03);
  /* Interface Control 2: SCLK is Re-timed signal from MCLK, BIAS: 0.5*VA */
  counter += Codec_WriteRegister(0x07, 0x00);
  /* ADCA and PGAA Select: MICx selected */
  counter += Codec_WriteRegister(0x08, 0x90);
  /* ADCB and PGAB Select: MICx selected */
  counter += Codec_WriteRegister(0x09, 0x90);
  /* Misc ADC Control: SDOUT Signal Source is ADC_or_DSP */
  counter += Codec_WriteRegister(0x0C, 0x00);
  /* Play Back Control 1: headphone gain is 0.4, PCM not inverted, Master not mute */
  counter += Codec_WriteRegister(0x0D, 0x00);
  /* Miscellaneous Controls: Passthrough Analog & Passthrough Mute off, Soft Ramp on @0x0E */
  counter += Codec_WriteRegister(0x0E, 0x02);
  /* Play Back Control 2: Headphone Mute on, speaker mute off, mono enabled */
  counter += Codec_WriteRegister(0x0F, 0xC2);
  /* MICA Amp Control: select MIC 2x, Single-Ended, Gain=16db */
  counter += Codec_WriteRegister(0x10, 0x2E);
  /* MICB Amp Control: select MIC 2x, Single-Ended, Gain=16db */
  counter += Codec_WriteRegister(0x11, 0x40);
  /* MICB Amp Control: try with Differential, Gain=16db */
  counter += Codec_WriteRegister(0x11, 0x20);
  /* PGA Volume ALC Control: Gain=0db */
  counter += Codec_WriteRegister(0x12, 0x00);
  /* PGA Volume ALC Control: Gain=0db */
  counter += Codec_WriteRegister(0x13, 0x00); 
  counter += Codec_WriteRegister(0x34, 5<<4);
  
